# pd.read_excel :: 엑셀 파일 불러오기  
*pd.read_excel( io, sheet_name=0, header=0, names=None, index_col=None, usecols=None, squeeze=False, dtype=None, engine=None, converters=None, true_values=None, false_values=None, skiprows=None, nrows=None, na_values=None, keep_default_na=True, na_filter=True, verbose=False, parse_dates=False, date_parser=None, thousands=None, comment=None, skipfooter=0, convert_float=True, mangle_dupe_cols=True)*

In [1]:
import pandas as pd

### 1. pd.read_excel('경로/파일명.파일형식')

In [2]:
pd.read_excel('example.xlsx')

   Num  Name Grade
0    1   Kim    A+
1    2   Lee     A
2    3  Park     B

### 2. 시트(Sheet) 지정
sheet_name = '불러올 시트명'

In [3]:
# 이름으로 불러오기
pd.read_excel('example.xlsx', sheet_name = '2nd Sheet')

    과일     가격   색
0   레몬   1000  노랑
1  바나나    800  노랑
2    귤    500  주황
3   체리  10000  빨강
4   키위   6000  초록

In [4]:
# 시트 번호로 불러오기(시작이 0)
pd.read_excel('example.xlsx', sheet_name = 1)

    과일     가격   색
0   레몬   1000  노랑
1  바나나    800  노랑
2    귤    500  주황
3   체리  10000  빨강
4   키위   6000  초록

### 3. header 지정

In [5]:
pd.read_excel('example.xlsx', header = 1)

   1   Kim A+
0  2   Lee  A
1  3  Park  B

In [6]:
pd.read_excel('example.xlsx', header = None)

     0     1      2
0  Num  Name  Grade
1    1   Kim     A+
2    2   Lee      A
3    3  Park      B

### 4. names : column명 변경

In [7]:
pd.read_excel('example.xlsx', names = ['번호', '이름', '성적'])

   번호    이름  성적
0   1   Kim  A+
1   2   Lee   A
2   3  Park   B

### 5. usecols : 사용할 열 지정

In [8]:
# 이름으로 지정
pd.read_excel('example.xlsx', usecols = ['Name', 'Grade'])

   Name Grade
0   Kim    A+
1   Lee     A
2  Park     B

In [9]:
# 번호로 지정
pd.read_excel('example.xlsx', usecols = [1, 2])

   Name Grade
0   Kim    A+
1   Lee     A
2  Park     B

### 6. na_values : 결측값 인식하기
결측값(NA / NaN)으로 인식 할 문자열 지정

'', '# N / A', '# N / AN / A', '#NA', '-1. # IND', '-1. # QNAN', '-NaN', '-nan', '1. # IND', '1. # QNAN', '<NA>', 'N / A', 'NA', 'NULL', 'NaN', 'n / a ','nan ','null '는 기본적으로 결측값으로 인식된다.

In [10]:
# 예시데이터
pd.read_excel('example.xlsx', sheet_name = 2)

   Num  Name Grade
0    1   Kim    A+
1    2   Lee     C
2    3  Park     -

In [11]:
# 결측값 인식하기
pd.read_excel('example.xlsx', sheet_name = 2, na_values = '-')

   Num  Name Grade
0    1   Kim    A+
1    2   Lee     C
2    3  Park   NaN

### 7. 불러올 행 제한

nrows : 불러올 행 개수 제한 / 처음 ~ n번째 행만 불러오기 

skiprows : 처음 ~ n번째 행 제외 / n+1번째 ~ 마지막까지

skipfooter : 뒤에서 n개 제외

In [12]:
# 처음 ~ n번째
pd.read_excel('example.xlsx', nrows = 2)

   Num Name Grade
0    1  Kim    A+
1    2  Lee     A

In [13]:
# 앞에서 n개 행 생략
pd.read_excel('example.xlsx', skiprows = 2)

   2   Lee  A
0  3  Park  B

In [14]:
# 뒤에서 n개 행 생략
pd.read_excel('example.xlsx', skipfooter = 2)

   Num Name Grade
0    1  Kim    A+